DynamoServices.AuthServices
Static class containing authentication service events. Useful if you want to make authenticated requests from your nodes.

DynamoServices.AuthServices.RequestAuthProvider
Event triggered to request an authentication provider.

DynamoServices.AuthServices.AuthProvider
Returns the active DynamoModel's AuthProvider.
Returns: The IOAuth2AccessTokenProvider associated with the active DynamoModel.
It's possible this property might be null.