DynamoServices.RequestAuthProviderEventArgs
Event arguments for the RequestAuthProvider event.

DynamoServices.RequestAuthProviderEventArgs.AuthProvider
Gets or sets the found auth provider, if one is found. It's possible that
this willl be null.