Dynamo.Logging.Categories.ApplicationLifecycle
XXXOperations usually means actions from Dynamo users
v.s. XXX usually means actions from the Dynamo component itself
Events Category related to application lifecycle

Dynamo.Logging.Categories.DynamoHomeOperations
Events Category related to DynamoHome