Dynamo.PythonServices.PythonEngine.HostDataMarshaler
Data marshaler for host data used during the execution of a Python node.
This can be implemented differently across various Python engines due to
factors such as differing PythonNet APIs or other specific requirements.

Dynamo.PythonServices.PythonEngine.RegisterHostDataMarshalers
Add additional data marshalers to handle host data.
While some data marshalers are specific to the host application,
they must be implemented at the Dynamo Core level in order to
avoid host dependencies on the Python runtime.