Dynamo.Logging.Actions.MissingDocumentation
When the in-depth node help documentation is un-available

Dynamo.Logging.Actions.Startup
Timed event: tracks startup time

Dynamo.Logging.Actions.ViewStartup
Timed event: tracks view startup time

Dynamo.Logging.Actions.UpdateGraphAsyncTask
Timed event: tracks graph execution time